In [1]:
%run helper/setup_notebook.ipynb import display_table

Successfully connected to leetcode50 database.

In [2]:
display_table('Employees')

+-------------+-----------+------------+--------+
| employee_id |    name   | manager_id | salary |
+-------------+-----------+------------+--------+
|      3      |    Mila   |     9      | 60301  |
|      12     | Antonella |    None    | 31000  |
|      13     |   Emery   |    None    | 67084  |
|      1      |   Kalel   |     11     | 21241  |
|      9      |  Mikaela  |    None    | 50937  |
|      11     |   Joziah  |     6      | 28485  |
+-------------+-----------+------------+--------+

### Write an SQL query to report the IDs of the employees whose salary is strictly less than $30000 and whose manager left the company. When a manager leaves the company, their information is deleted from the Employees table, but the reports still have their manager_id set to the manager that left.

### *Return the result table ordered by employee_id.*

```
+-------------+
| employee_id |
+-------------+
| 11          |
+-------------+

Explanation: 
The employees with a salary less than $30000 are 1 (Kalel) and 11 (Joziah).
Kalel's manager is employee 11, who is still in the company (Joziah).
Joziah's manager is employee 6, who left the company because there is no row for employee 6 as it was deleted.
```

In [3]:
%%sql 

SELECT 
    employee_id
FROM Employees 
WHERE salary < 30000;

[(1,), (11,)]

In [4]:
%%sql 

SELECT 
    employee_id
FROM Employees 
WHERE salary < 30000 AND manager_id NOT IN (SELECT employee_id FROM Employees)
ORDER BY employee_id;

[(11,)]

# Using Pandas

In [5]:
import pandas as pd

In [6]:
employees_query = %sql SELECT * FROM Employees # type: ignore
employees_df = employees_query.DataFrame()

display(employees_df)

   employee_id       name  manager_id  salary
0            3       Mila         9.0   60301
1           12  Antonella         NaN   31000
2           13      Emery         NaN   67084
3            1      Kalel        11.0   21241
4            9    Mikaela         NaN   50937
5           11     Joziah         6.0   28485

In [7]:
employees_df.query("salary < 30_000")

   employee_id    name  manager_id  salary
3            1   Kalel        11.0   21241
5           11  Joziah         6.0   28485

In [8]:
employees_df['employee_id'].values

array([ 3, 12, 13,  1,  9, 11])

In [9]:
active_employee_ids = list(employees_df['employee_id'].values)
active_employee_ids

[3, 12, 13, 1, 9, 11]

In [10]:
employees_df.query("salary < 30_000 and manager_id not in @active_employee_ids")

   employee_id    name  manager_id  salary
5           11  Joziah         6.0   28485

In [11]:
employees_df.query("salary < 30_000 and manager_id not in @active_employee_ids")[['employee_id']]

   employee_id
5           11